; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem roverprob30105) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 - Rover
	rover0store rover1store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 waypoint11 - Waypoint
	camera0 camera1 camera2 - Camera
	objective0 objective1 objective2 objective3 - Objective
	)
(:init
	(visible waypoint0 waypoint2)
	(visible waypoint2 waypoint0)
	(visible waypoint0 waypoint6)
	(visible waypoint6 waypoint0)
	(visible waypoint1 waypoint0)
	(visible waypoint0 waypoint1)
	(visible waypoint1 waypoint4)
	(visible waypoint4 waypoint1)
	(visible waypoint1 waypoint5)
	(visible waypoint5 waypoint1)
	(visible waypoint1 waypoint11)
	(visible waypoint11 waypoint1)
	(visible waypoint2 waypoint4)
	(visible waypoint4 waypoint2)
	(visible waypoint2 waypoint9)
	(visible waypoint9 waypoint2)
	(visible waypoint2 waypoint10)
	(visible waypoint10 waypoint2)
	(visible waypoint3 waypoint4)
	(visible waypoint4 waypoint3)
	(visible waypoint3 waypoint6)
	(visible waypoint6 waypoint3)
	(visible waypoint4 waypoint0)
	(visible waypoint0 waypoint4)
	(visible waypoint4 waypoint5)
	(visible waypoint5 waypoint4)
	(visible waypoint4 waypoint9)
	(visible waypoint9 waypoint4)
	(visible waypoint5 waypoint3)
	(visible waypoint3 waypoint5)
	(visible waypoint5 waypoint7)
	(visible waypoint7 waypoint5)
	(visible waypoint5 waypoint8)
	(visible waypoint8 waypoint5)
	(visible waypoint5 waypoint9)
	(visible waypoint9 waypoint5)
	(visible waypoint5 waypoint10)
	(visible waypoint10 waypoint5)
	(visible waypoint6 waypoint2)
	(visible waypoint2 waypoint6)
	(visible waypoint6 waypoint5)
	(visible waypoint5 waypoint6)
	(visible waypoint6 waypoint9)
	(visible waypoint9 waypoint6)
	(visible waypoint7 waypoint4)
	(visible waypoint4 waypoint7)
	(visible waypoint7 waypoint6)
	(visible waypoint6 waypoint7)
	(visible waypoint8 waypoint0)
	(visible waypoint0 waypoint8)
	(visible waypoint8 waypoint1)
	(visible waypoint1 waypoint8)
	(visible waypoint9 waypoint0)
	(visible waypoint0 waypoint9)
	(visible waypoint9 waypoint8)
	(visible waypoint8 waypoint9)
	(visible waypoint10 waypoint1)
	(visible waypoint1 waypoint10)
	(visible waypoint10 waypoint3)
	(visible waypoint3 waypoint10)
	(visible waypoint10 waypoint4)
	(visible waypoint4 waypoint10)
	(visible waypoint10 waypoint6)
	(visible waypoint6 waypoint10)
	(visible waypoint10 waypoint7)
	(visible waypoint7 waypoint10)
	(visible waypoint10 waypoint9)
	(visible waypoint9 waypoint10)
	(visible waypoint11 waypoint0)
	(visible waypoint0 waypoint11)
	(visible waypoint11 waypoint2)
	(visible waypoint2 waypoint11)
	(visible waypoint11 waypoint7)
	(visible waypoint7 waypoint11)
	(visible waypoint11 waypoint10)
	(visible waypoint10 waypoint11)
	(at_rock_sample waypoint0)
	(at_soil_sample waypoint1)
	(at_rock_sample waypoint1)
	(at_soil_sample waypoint2)
	(at_soil_sample waypoint3)
	(at_rock_sample waypoint7)
	(at_soil_sample waypoint8)
	(at_soil_sample waypoint9)
	(at_rock_sample waypoint9)
	(at_soil_sample waypoint10)
	(at_rock_sample waypoint10)
	(at_soil_sample waypoint11)
	(at_rock_sample waypoint11)
	(at_lander general waypoint7)
	(channel_free general)
	(at rover0 waypoint3)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_rock_analysis rover0)
	(equipped_for_imaging rover0)
	(can_traverse rover0 waypoint3 waypoint4)
	(can_traverse rover0 waypoint4 waypoint3)
	(can_traverse rover0 waypoint3 waypoint5)
	(can_traverse rover0 waypoint5 waypoint3)
	(can_traverse rover0 waypoint3 waypoint6)
	(can_traverse rover0 waypoint6 waypoint3)
	(can_traverse rover0 waypoint3 waypoint10)
	(can_traverse rover0 waypoint10 waypoint3)
	(can_traverse rover0 waypoint4 waypoint1)
	(can_traverse rover0 waypoint1 waypoint4)
	(can_traverse rover0 waypoint4 waypoint2)
	(can_traverse rover0 waypoint2 waypoint4)
	(can_traverse rover0 waypoint4 waypoint9)
	(can_traverse rover0 waypoint9 waypoint4)
	(can_traverse rover0 waypoint5 waypoint7)
	(can_traverse rover0 waypoint7 waypoint5)
	(can_traverse rover0 waypoint5 waypoint8)
	(can_traverse rover0 waypoint8 waypoint5)
	(can_traverse rover0 waypoint10 waypoint11)
	(can_traverse rover0 waypoint11 waypoint10)
	(can_traverse rover0 waypoint2 waypoint0)
	(can_traverse rover0 waypoint0 waypoint2)
	(at rover1 waypoint6)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_soil_analysis rover1)
	(equipped_for_imaging rover1)
	(can_traverse rover1 waypoint6 waypoint0)
	(can_traverse rover1 waypoint0 waypoint6)
	(can_traverse rover1 waypoint6 waypoint2)
	(can_traverse rover1 waypoint2 waypoint6)
	(can_traverse rover1 waypoint6 waypoint3)
	(can_traverse rover1 waypoint3 waypoint6)
	(can_traverse rover1 waypoint6 waypoint5)
	(can_traverse rover1 waypoint5 waypoint6)
	(can_traverse rover1 waypoint0 waypoint1)
	(can_traverse rover1 waypoint1 waypoint0)
	(can_traverse rover1 waypoint0 waypoint4)
	(can_traverse rover1 waypoint4 waypoint0)
	(can_traverse rover1 waypoint0 waypoint9)
	(can_traverse rover1 waypoint9 waypoint0)
	(can_traverse rover1 waypoint0 waypoint11)
	(can_traverse rover1 waypoint11 waypoint0)
	(can_traverse rover1 waypoint2 waypoint10)
	(can_traverse rover1 waypoint10 waypoint2)
	(can_traverse rover1 waypoint5 waypoint8)
	(can_traverse rover1 waypoint8 waypoint5)
	(can_traverse rover1 waypoint4 waypoint7)
	(can_traverse rover1 waypoint7 waypoint4)
	(on_board camera0 rover0)
	(calibration_target camera0 objective1)
	(supports camera0 high_res)
	(on_board camera1 rover1)
	(calibration_target camera1 objective1)
	(supports camera1 high_res)
	(supports camera1 low_res)
	(on_board camera2 rover1)
	(calibration_target camera2 objective3)
	(supports camera2 high_res)
	(visible_from objective0 waypoint6)
	(visible_from objective1 waypoint1)
	(visible_from objective1 waypoint3)
	(visible_from objective1 waypoint6)
	(visible_from objective1 waypoint10)
	(visible_from objective2 waypoint0)
	(visible_from objective2 waypoint2)
	(visible_from objective2 waypoint3)
	(visible_from objective2 waypoint5)
	(visible_from objective2 waypoint11)
	(visible_from objective3 waypoint5)
	(visible_from objective3 waypoint6)
)

(:goal (and
(communicated_soil_data waypoint3)
(communicated_soil_data waypoint8)
(communicated_soil_data waypoint2)
(communicated_soil_data waypoint9)
(communicated_rock_data waypoint9)
(communicated_rock_data waypoint10)
(communicated_image_data objective2 low_res)
(communicated_image_data objective1 high_res)
	)
)
)

; plan
1. (calibrate rover1 camera1 objective1 waypoint6)
   added: (calibrated camera1 rover1)
   goals met: 0 of 8
2. (calibrate rover0 camera0 objective1 waypoint3)
   added: (calibrated camera0 rover0)
   goals met: 0 of 8
3. (calibrate rover1 camera2 objective3 waypoint6)
   added: (calibrated camera2 rover1)
   goals met: 0 of 8
4. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 0 of 8
5. (navigate rover0 waypoint3 waypoint10)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint10)
   goals met: 0 of 8
6. (take_image rover1 waypoint5 objective2 camera1 low_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective2 low_res)
   goals met: 0 of 8
7. (take_image rover0 waypoint10 objective1 camera0 high_res)
   deleted: (calibrated camera0 rover0)
   added: (have_image rover0 objective1 high_res)
   goals met: 0 of 8
8. (sample_rock rover0 rover0store waypoint10)
   deleted: (empty rover0store) (at_rock_sample waypoint10)
   added: (have_rock_analysis rover0 waypoint10) (full rover0store)
   goals met: 0 of 8
9. (communicate_image_data rover1 general objective2 low_res waypoint5 waypoint7)
   added: (communicated_image_data objective2 low_res)
   goals met: 1 of 8
10. (communicate_image_data rover0 general objective1 high_res waypoint10 waypoint7)
   added: (communicated_image_data objective1 high_res)
   goals met: 2 of 8
11. (navigate rover1 waypoint5 waypoint8)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint8)
   goals met: 2 of 8
12. (communicate_rock_data rover0 general waypoint10 waypoint10 waypoint7)
   added: (communicated_rock_data waypoint10)
   goals met: 3 of 8
13. (sample_soil rover1 rover1store waypoint8)
   deleted: (empty rover1store) (at_soil_sample waypoint8)
   added: (have_soil_analysis rover1 waypoint8) (full rover1store)
   goals met: 3 of 8
14. (navigate rover1 waypoint8 waypoint5)
   deleted: (at rover1 waypoint8)
   added: (at rover1 waypoint5)
   goals met: 3 of 8
15. (navigate rover0 waypoint10 waypoint3)
   deleted: (at rover0 waypoint10)
   added: (at rover0 waypoint3)
   goals met: 3 of 8
16. (communicate_soil_data rover1 general waypoint8 waypoint5 waypoint7)
   added: (communicated_soil_data waypoint8)
   goals met: 4 of 8
17. (navigate rover0 waypoint3 waypoint4)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint4)
   goals met: 4 of 8
18. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 4 of 8
19. (navigate rover1 waypoint5 waypoint6)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint6)
   goals met: 4 of 8
20. (navigate rover0 waypoint4 waypoint9)
   deleted: (at rover0 waypoint4)
   added: (at rover0 waypoint9)
   goals met: 4 of 8
21. (sample_rock rover0 rover0store waypoint9)
   deleted: (empty rover0store) (at_rock_sample waypoint9)
   added: (have_rock_analysis rover0 waypoint9) (full rover0store)
   goals met: 4 of 8
22. (navigate rover1 waypoint6 waypoint3)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint3)
   goals met: 4 of 8
23. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 4 of 8
24. (navigate rover0 waypoint9 waypoint4)
   deleted: (at rover0 waypoint9)
   added: (at rover0 waypoint4)
   goals met: 4 of 8
25. (sample_soil rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_soil_sample waypoint3)
   added: (have_soil_analysis rover1 waypoint3) (full rover1store)
   goals met: 4 of 8
26. (communicate_rock_data rover0 general waypoint9 waypoint4 waypoint7)
   added: (communicated_rock_data waypoint9)
   goals met: 5 of 8
27. (navigate rover1 waypoint3 waypoint6)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint6)
   goals met: 5 of 8
28. (communicate_soil_data rover1 general waypoint3 waypoint6 waypoint7)
   added: (communicated_soil_data waypoint3)
   goals met: 6 of 8
29. (navigate rover1 waypoint6 waypoint2)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint2)
   goals met: 6 of 8
30. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 6 of 8
31. (sample_soil rover1 rover1store waypoint2)
   deleted: (empty rover1store) (at_soil_sample waypoint2)
   added: (have_soil_analysis rover1 waypoint2) (full rover1store)
   goals met: 6 of 8
32. (navigate rover1 waypoint2 waypoint10)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint10)
   goals met: 6 of 8
33. (communicate_soil_data rover1 general waypoint2 waypoint10 waypoint7)
   added: (communicated_soil_data waypoint2)
   goals met: 7 of 8
34. (navigate rover1 waypoint10 waypoint2)
   deleted: (at rover1 waypoint10)
   added: (at rover1 waypoint2)
   goals met: 7 of 8
35. (navigate rover1 waypoint2 waypoint6)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint6)
   goals met: 7 of 8
36. (navigate rover1 waypoint6 waypoint0)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint0)
   goals met: 7 of 8
37. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 7 of 8
38. (navigate rover1 waypoint0 waypoint9)
   deleted: (at rover1 waypoint0)
   added: (at rover1 waypoint9)
   goals met: 7 of 8
39. (sample_soil rover1 rover1store waypoint9)
   deleted: (empty rover1store) (at_soil_sample waypoint9)
   added: (have_soil_analysis rover1 waypoint9) (full rover1store)
   goals met: 7 of 8
40. (navigate rover1 waypoint9 waypoint0)
   deleted: (at rover1 waypoint9)
   added: (at rover1 waypoint0)
   goals met: 7 of 8
41. (navigate rover1 waypoint0 waypoint11)
   deleted: (at rover1 waypoint0)
   added: (at rover1 waypoint11)
   goals met: 7 of 8
42. (communicate_soil_data rover1 general waypoint9 waypoint11 waypoint7)
   added: (communicated_soil_data waypoint9)
   goals met: 8 of 8
